## Pivot:
- Pivot helps you to arrange the table as per the user's choice.

In [16]:
df_20 = pd.DataFrame({'S.No': [1,2,3,4,5], 'A':['apple','ant','ankle','air','arm'], 'B':['ball','bat','bear','balloon','boy']})
print(df_20)

   S.No      A        B
0     1  apple     ball
1     2    ant      bat
2     3  ankle     bear
3     4    air  balloon
4     5    arm      boy

In [18]:
df_20.pivot(index='A', columns='B', values='B')

B      ball  balloon  bat  bear  boy
A
air     NaN  balloon  NaN   NaN  NaN
ankle   NaN      NaN  NaN  bear  NaN
ant     NaN      NaN  bat   NaN  NaN
apple  ball      NaN  NaN   NaN  NaN
arm     NaN      NaN  NaN   NaN  boy

In [20]:
df_20.pivot(index="S.No", columns="A")["B"]

A         air ankle  ant apple  arm
S.No
1         NaN   NaN  NaN  ball  NaN
2         NaN   NaN  bat   NaN  NaN
3         NaN  bear  NaN   NaN  NaN
4     balloon   NaN  NaN   NaN  NaN
5         NaN   NaN  NaN   NaN  boy

In [22]:
df_20.pivot(index="S.No", columns="A", values=["A","B"])

        A                                B
A     air  ankle  ant  apple  arm      air ankle  ant apple  arm
S.No
1     NaN    NaN  NaN  apple  NaN      NaN   NaN  NaN  ball  NaN
2     NaN    NaN  ant    NaN  NaN      NaN   NaN  bat   NaN  NaN
3     NaN  ankle  NaN    NaN  NaN      NaN  bear  NaN   NaN  NaN
4     air    NaN  NaN    NaN  NaN  balloon   NaN  NaN   NaN  NaN
5     NaN    NaN  NaN    NaN  arm      NaN   NaN  NaN   NaN  boy